cats_app/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 33]]
---

<% @cat.rental_requests.each do |rental| %>