cats_app/app/controllers/cat_rental_requests_controller.rb

  def create
    request = CatRentalRequest.new(rental_params)
    if request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 33], ["start_date", "2018-12-18"], ["end_date", "2018-12-22"], ["created_at", "2018-12-18 22:26:19.640762"], ["updated_at", "2018-12-18 22:26:19.640762"]]