cats_app/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "color" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "M"], ["color", "green"], ["updated_at", "2018-12-18 19:16:39.695571"], ["id", 12]]
---
  def update
    cat = Cat.find(params[:id])
    if cat.update(cat_params)